#Область СлужебныеПроцедурыИФункции
Процедура ДополнитьФорму(Форма) Экспорт

// Добавляет на форму всех документов поле "КонтактноеЛицо"
//и Группу для пересчета табличных частей в Документе "ЗаказПокупателя"	
	ИмяФормы = Форма.ИмяФормы;
	
	Если ИмяФормы = "Документ.ЗаказПокупателя.Форма.ФормаДокумента" Тогда
		ДобавитьПолеКонтактноеЛицоНаФормуВГруппаШапкаПраво(Форма);
		ДобавитьГруппаДЗ13_2НаФорму(Форма);
		ДобавитьПолеСогласованнаяСкидкаВГруппаДЗ13_2(Форма);
		ДобавитьКнопкуПересчитатьТаблицуВГруппаДЗ13_2(Форма);
	ИначеЕсли ИмяФормы = "Документ.ОплатаОтПокупателя.Форма.ФормаДокумента" Тогда
		ДобавитьПолеКонтактноеЛицоНаФормуПередСуммаДокумента(Форма);
	ИначеЕсли ИмяФормы = "Документ.ОплатаПоставщику.Форма.ФормаДокумента" Тогда
		ДобавитьПолеКонтактноеЛицоНаФормуПередСуммаДокумента(Форма);
	ИначеЕсли ИмяФормы = "Документ.ПоступлениеТоваровУслуг.Форма.ФормаДокумента" Тогда
		ДобавитьПолеКонтактноеЛицоНаФормуВГруппаШапкаПраво(Форма);
	ИначеЕсли ИмяФормы = "Документ.РеализацияТоваровУслуг.Форма.ФормаДокумента" Тогда
		ДобавитьПолеКонтактноеЛицоНаФормуВГруппаШапкаПраво(Форма);
	КонецЕсли;
	
КонецПроцедуры

Процедура ДобавитьПолеКонтактноеЛицоНаФормуВГруппаШапкаПраво(Форма)
	
	ПолеВвода = Форма.Элементы.Добавить("КонтактноеЛицо", Тип("ПолеФормы"), Форма.Элементы.ГруппаШапкаПраво);
	ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
	ПолеВвода.ПутьКДанным = "Объект.ДЗ13_2_КонтактноеЛицо";
	
КонецПроцедуры

Процедура ДобавитьПолеКонтактноеЛицоНаФормуПередСуммаДокумента(Форма)
	
	ПолеВвода = Форма.Элементы.Добавить("КонтактноеЛицо", Тип("ПолеФормы"), Форма);
	ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
	ПолеВвода.ПутьКДанным = "Объект.ДЗ13_2_КонтактноеЛицо";
	
КонецПроцедуры

Процедура ДобавитьГруппаДЗ13_2НаФорму(Форма)
	НоваяГруппа = Форма.Элементы.Добавить("ГруппаДЗ13_2", Тип("ГруппаФормы"), Форма.Элементы.ГруппаШапкаЛево);
	НоваяГруппа.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	НоваяГруппа.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
	НоваяГруппа.Заголовок = "ДЗ13_2";
	НоваяГруппа.ОтображатьЗаголовок = Ложь;
КонецПроцедуры

Процедура ДобавитьПолеСогласованнаяСкидкаВГруппаДЗ13_2(Форма)
	
	ПолеВвода = Форма.Элементы.Добавить("СогласованнаяСкидка", Тип("ПолеФормы"), Форма.Элементы.ГруппаДЗ13_2);
	ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
	ПолеВвода.ПутьКДанным = "Объект.ДЗ13_2_СогласованнаяСкидка";
	ПолеВвода.УстановитьДействие("ПриИзменении", "ДЗ13_2_СогласованнаяСкидкаПриИзменении");
	
КонецПроцедуры

Процедура ДобавитьКнопкуПересчитатьТаблицуВГруппаДЗ13_2(Форма)
	
	// Создаётся новая команда в коллекции команд формы с уникальным именем.  
    НоваяКоманда = Форма.Команды.Добавить("ПересчитатьТаблицу1");  
    // Устанавливается заголовок команды, который будет отображаться на кнопке.  
    НоваяКоманда.Заголовок = "Пересчитать таблицу";  
    // Привязывается действие, которое выполнится при нажатии на кнопку.  
    НоваяКоманда.Действие = "ПересчитатьТаблицу";  
    // Добавляется элемент на форму — кнопка.  
    НоваяКнопка = Форма.Элементы.Добавить("Кнопка", Тип("КнопкаФормы"), Форма.Элементы.ГруппаДЗ13_2);  
    // Привязывается созданная команда к кнопке.  
    НоваяКнопка.ИмяКоманды = "ПересчитатьТаблицу1"; 
	
КонецПроцедуры
//--
# КонецОбласти